In [ ]:
#Load a CSV
import pandas as pd

df = pd.read_csv("data.csv")
df.head(10)

In [2]:
#Select specific columns
df[['name', 'salary', 'department']]

             name  salary   department
0     Aarav Mehta   65000  Engineering
1   Ananya Sharma   48000    Marketing
2     Rohan Patil   52000        Sales
3      Neha Verma   45000           HR
4     Aditya Nair   70000  Engineering
5    Shruti Desai   55000      Finance
6    Vikram Joshi   50000        Sales
7  Pooja Kulkarni   72000  Engineering
8       Raj Singh   60000      Finance
9   Kavita Pillai   47000    Marketing

In [3]:
#Filter rows
df[df['salary'] > 50000]

   id            name   department  salary  age gender
0   1     Aarav Mehta  Engineering   65000   28      M
2   3     Rohan Patil        Sales   52000   32      M
4   5     Aditya Nair  Engineering   70000   30      M
5   6    Shruti Desai      Finance   55000   29      F
7   8  Pooja Kulkarni  Engineering   72000   26      F
8   9       Raj Singh      Finance   60000   31      M

In [4]:
#Group by and average
df.groupby("department")["salary"].mean()

department
Engineering    69000.0
Finance        57500.0
HR             45000.0
Marketing      47500.0
Sales          51000.0
Name: salary, dtype: float64

In [5]:
#New column with calculation
df["annual_salary"] = df["salary"] * 12
df.head()

   id           name   department  salary  age gender  annual_salary
0   1    Aarav Mehta  Engineering   65000   28      M         780000
1   2  Ananya Sharma    Marketing   48000   25      F         576000
2   3    Rohan Patil        Sales   52000   32      M         624000
3   4     Neha Verma           HR   45000   27      F         540000
4   5    Aditya Nair  Engineering   70000   30      M         840000

In [7]:
#Missing Values
df.fillna({"salary": df["salary"].mean()}, inplace=True)

In [8]:
#Sort Data
df.groupby("department")["salary"].mean()

department
Engineering    69000.0
Finance        57500.0
HR             45000.0
Marketing      47500.0
Sales          51000.0
Name: salary, dtype: float64

In [9]:
#New column with calculation
df["annual_salary"] = df["salary"] * 12
df.head()

   id           name   department  salary  age gender  annual_salary
0   1    Aarav Mehta  Engineering   65000   28      M         780000
1   2  Ananya Sharma    Marketing   48000   25      F         576000
2   3    Rohan Patil        Sales   52000   32      M         624000
3   4     Neha Verma           HR   45000   27      F         540000
4   5    Aditya Nair  Engineering   70000   30      M         840000

In [10]:
#Sort employees by salary
df.sort_values("salary", ascending=False)

   id            name   department  salary  age gender  annual_salary
7   8  Pooja Kulkarni  Engineering   72000   26      F         864000
4   5     Aditya Nair  Engineering   70000   30      M         840000
0   1     Aarav Mehta  Engineering   65000   28      M         780000
8   9       Raj Singh      Finance   60000   31      M         720000
5   6    Shruti Desai      Finance   55000   29      F         660000
2   3     Rohan Patil        Sales   52000   32      M         624000
6   7    Vikram Joshi        Sales   50000   35      M         600000
1   2   Ananya Sharma    Marketing   48000   25      F         576000
9  10   Kavita Pillai    Marketing   47000   24      F         564000
3   4      Neha Verma           HR   45000   27      F         540000

In [11]:
df.fillna({"salary": df["salary"].mean()}, inplace=True)

------------------Slicing----------------------

In [12]:
import pandas as pd

player_list = [['M.S.Dhoni', 36, 75, 5428000],
               ['A.B.D Villers', 38, 74, 3428000],
               ['V.Kohli', 31, 70, 8428000],
               ['S.Smith', 34, 80, 4428000],
               ['C.Gayle', 40, 100, 4528000],
               ['J.Root', 33, 72, 7028000],
               ['K.Peterson', 42, 85, 2528000]]

df = pd.DataFrame(player_list, columns=['Name', 'Age', 'Weight', 'Salary'])
print(df)

            Name  Age  Weight   Salary
0      M.S.Dhoni   36      75  5428000
1  A.B.D Villers   38      74  3428000
2        V.Kohli   31      70  8428000
3        S.Smith   34      80  4428000
4        C.Gayle   40     100  4528000
5         J.Root   33      72  7028000
6     K.Peterson   42      85  2528000

In [13]:
df1 = df.iloc[0:2]
print(df1)

            Name  Age  Weight   Salary
0      M.S.Dhoni   36      75  5428000
1  A.B.D Villers   38      74  3428000

In [14]:
df1 = df.iloc[:,0:2]
print(df1)

            Name  Age
0      M.S.Dhoni   36
1  A.B.D Villers   38
2        V.Kohli   31
3        S.Smith   34
4        C.Gayle   40
5         J.Root   33
6     K.Peterson   42

In [15]:
value = df.iloc[2,3]
print(value)

8428000

In [16]:
data = df[df['Age']>35]
print(data)

            Name  Age  Weight   Salary
0      M.S.Dhoni   36      75  5428000
1  A.B.D Villers   38      74  3428000
4        C.Gayle   40     100  4528000
6     K.Peterson   42      85  2528000

In [17]:
data = df[df['Age']>35].iloc[:,:]
print(data)

            Name  Age  Weight   Salary
0      M.S.Dhoni   36      75  5428000
1  A.B.D Villers   38      74  3428000
4        C.Gayle   40     100  4528000
6     K.Peterson   42      85  2528000

In [18]:
df.set_index('Name',inplace=True)

In [20]:
custom = df.loc['A.B.D Villers':'S.Smith']
print(custom)

               Age  Weight   Salary
Name
A.B.D Villers   38      74  3428000
V.Kohli         31      70  8428000
S.Smith         34      80  4428000

--------Filter Pandas Dataframe with multiple conditions----------

In [22]:
# import module
import pandas as pd

# assign data
df = pd.DataFrame({'Name': [' RACHEL  ', ' MONICA  ', ' PHOEBE  ',
                                   '  ROSS    ', 'CHANDLER', ' JOEY    '],
                          
                          'Age': [30, 35, 37, 33, 34, 30],
                          
                          'Salary': [100000, 93000, 88000, 120000, 94000, 95000],
                          
                          'JOB': ['DESIGNER', 'CHEF', 'MASUS', 'PALENTOLOGY',
                                  'IT', 'ARTIST']})

# display dataframe
display(df)

         Name  Age  Salary          JOB
0    RACHEL     30  100000     DESIGNER
1    MONICA     35   93000         CHEF
2    PHOEBE     37   88000        MASUS
3    ROSS       33  120000  PALENTOLOGY
4    CHANDLER   34   94000           IT
5    JOEY       30   95000       ARTIST

In [23]:
display(df.loc[(df['Salary']>=100000) & (df['Age']< 40) & (df['JOB'].str.startswith('D')),
                    ['Name','JOB']])

        Name       JOB
0   RACHEL    DESIGNER

In [25]:
# filter dataframe
import numpy as np
filtered_values = np.where((df['Salary']>=100000) & (df['Age']< 40) & (df['JOB'].str.startswith('D')))

In [26]:
print(filtered_values)

(array([0]),)

In [27]:
display(df.loc[filtered_values])

        Name  Age  Salary       JOB
0   RACHEL     30  100000  DESIGNER

In [28]:
display(dataFrame.query('Salary  <= 100000 & Age < 40 & JOB.str.startswith("C").values'))

        Name  Age  Salary   JOB
1   MONICA     35   93000  CHEF

In [29]:
# filter dataframe 
display(dataFrame[(dataFrame['Salary']>=100000) & (dataFrame['Age']<40) & dataFrame['JOB'].str.startswith('P')][['Name','Age','Salary']])

         Name  Age  Salary
3    ROSS       33  120000

In [30]:
# filter dataframe 
display(dataFrame[dataFrame.eval("Salary <=100000 & (Age <40) & JOB.str.startswith('A').values")])

        Name  Age  Salary     JOB
5   JOEY       30   95000  ARTIST

In [ ]:
-----Merging, Joining and Concatenating------

In [31]:
data1 = {'Name': ['Jai', 'Princi', 'Gaurav', 'Anuj'],
         'Age': [27, 24, 22, 32],
         'Address': ['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'],
         'Qualification': ['Msc', 'MA', 'MCA', 'Phd']}

In [32]:
data2 = {'Name': ['Abhi', 'Ayushi', 'Dhiraj', 'Hitesh'],
         'Age': [17, 14, 12, 52],
         'Address': ['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'],
         'Qualification': ['Btech', 'B.A', 'Bcom', 'B.hons']}

In [33]:
df = pd.DataFrame(data1, index=[0, 1, 2, 3])

In [34]:
df1 = pd.DataFrame(data2, index=[4, 5, 6, 7])

In [35]:
print(df, "\n\n", df1)

     Name  Age    Address Qualification
0     Jai   27     Nagpur           Msc
1  Princi   24     Kanpur            MA
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannuaj           Phd

      Name  Age    Address Qualification
4    Abhi   17     Nagpur         Btech
5  Ayushi   14     Kanpur           B.A
6  Dhiraj   12  Allahabad          Bcom
7  Hitesh   52    Kannuaj        B.hons

In [36]:
frames = [df, df1]

In [37]:
res1 = pd.concat(frames)

In [45]:
res1

     Name  Age    Address Qualification
0     Jai   27     Nagpur           Msc
1  Princi   24     Kanpur            MA
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannuaj           Phd
4    Abhi   17     Nagpur         Btech
5  Ayushi   14     Kanpur           B.A
6  Dhiraj   12  Allahabad          Bcom
7  Hitesh   52    Kannuaj        B.hons

In [39]:
data1 = {'Name': ['Jai', 'Princi', 'Gaurav', 'Anuj'],
         'Age': [27, 24, 22, 32],
         'Address': ['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'],
         'Qualification': ['Msc', 'MA', 'MCA', 'Phd'],
         'Mobile No': [97, 91, 58, 76]}

In [40]:
data2 = {'Name': ['Gaurav', 'Anuj', 'Dhiraj', 'Hitesh'],
         'Age': [22, 32, 12, 52],
         'Address': ['Allahabad', 'Kannuaj', 'Allahabad', 'Kannuaj'],
         'Qualification': ['MCA', 'Phd', 'Bcom', 'B.hons'],
         'Salary': [1000, 2000, 3000, 4000]}

In [41]:
df = pd.DataFrame(data1, index=[0, 1, 2, 3])

In [42]:
df1 = pd.DataFrame(data2, index=[2, 3, 6, 7])

In [43]:
print(df, "\n\n", df1)

     Name  Age    Address Qualification  Mobile No
0     Jai   27     Nagpur           Msc         97
1  Princi   24     Kanpur            MA         91
2  Gaurav   22  Allahabad           MCA         58
3    Anuj   32    Kannuaj           Phd         76

      Name  Age    Address Qualification  Salary
2  Gaurav   22  Allahabad           MCA    1000
3    Anuj   32    Kannuaj           Phd    2000
6  Dhiraj   12  Allahabad          Bcom    3000
7  Hitesh   52    Kannuaj        B.hons    4000

In [44]:
res2 = pd.concat([df, df1], axis=1, join='inner')

res2

,Name,Age,Address,Qualification,Mobile No,Name,Age,Address,Qualification,Salary
2,Gaurav,22,Allahabad,MCA,58,Gaurav,22,Allahabad,MCA,1000
3,Anuj,32,Kannuaj,Phd,76,Anuj,32,Kannuaj,Phd,2000

In [46]:
res = pd.concat([df, df1], ignore_index=True)
 
res

     Name  Age    Address Qualification  Mobile No  Salary
0     Jai   27     Nagpur           Msc       97.0     NaN
1  Princi   24     Kanpur            MA       91.0     NaN
2  Gaurav   22  Allahabad           MCA       58.0     NaN
3    Anuj   32    Kannuaj           Phd       76.0     NaN
4  Gaurav   22  Allahabad           MCA        NaN  1000.0
5    Anuj   32    Kannuaj           Phd        NaN  2000.0
6  Dhiraj   12  Allahabad          Bcom        NaN  3000.0
7  Hitesh   52    Kannuaj        B.hons        NaN  4000.0

In [47]:
import pandas as pd

data1 = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'],
        'Age':[27, 24, 22, 32],
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'],
        'Qualification':['Msc', 'MA', 'MCA', 'Phd']}

data2 = {'Name':['Abhi', 'Ayushi', 'Dhiraj', 'Hitesh'],
        'Age':[17, 14, 12, 52],
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'],
        'Qualification':['Btech', 'B.A', 'Bcom', 'B.hons']}

df = pd.DataFrame(data1,index=[0, 1, 2, 3])

df1 = pd.DataFrame(data2, index=[4, 5, 6, 7])

print(df, "\n\n", df1)

     Name  Age    Address Qualification
0     Jai   27     Nagpur           Msc
1  Princi   24     Kanpur            MA
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannuaj           Phd

      Name  Age    Address Qualification
4    Abhi   17     Nagpur         Btech
5  Ayushi   14     Kanpur           B.A
6  Dhiraj   12  Allahabad          Bcom
7  Hitesh   52    Kannuaj        B.hons

In [48]:
frames = [df, df1 ]

res = pd.concat(frames, keys=['x', 'y'])
res

       Name  Age    Address Qualification
x 0     Jai   27     Nagpur           Msc
  1  Princi   24     Kanpur            MA
  2  Gaurav   22  Allahabad           MCA
  3    Anuj   32    Kannuaj           Phd
y 4    Abhi   17     Nagpur         Btech
  5  Ayushi   14     Kanpur           B.A
  6  Dhiraj   12  Allahabad          Bcom
  7  Hitesh   52    Kannuaj        B.hons

In [49]:
import pandas as pd

data1 = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'],
        'Age':[27, 24, 22, 32],
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'],
        'Qualification':['Msc', 'MA', 'MCA', 'Phd']}

df = pd.DataFrame(data1,index=[0, 1, 2, 3])

s1 = pd.Series([1000, 2000, 3000, 4000], name='Salary')

print(df, "\n\n", s1)

     Name  Age    Address Qualification
0     Jai   27     Nagpur           Msc
1  Princi   24     Kanpur            MA
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannuaj           Phd

 0    1000
1    2000
2    3000
3    4000
Name: Salary, dtype: int64

In [50]:
res = pd.concat([df, s1], axis=1)

res

     Name  Age    Address Qualification  Salary
0     Jai   27     Nagpur           Msc    1000
1  Princi   24     Kanpur            MA    2000
2  Gaurav   22  Allahabad           MCA    3000
3    Anuj   32    Kannuaj           Phd    4000

In [51]:
#Merge
import pandas as pd

data1 = {'key': ['K0', 'K1', 'K2', 'K3'],
         'key1': ['K0', 'K1', 'K0', 'K1'],
         'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'],
        'Age':[27, 24, 22, 32],}

data2 = {'key': ['K0', 'K1', 'K2', 'K3'],
         'key1': ['K0', 'K0', 'K0', 'K0'],
         'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'],
        'Qualification':['Btech', 'B.A', 'Bcom', 'B.hons']}

df = pd.DataFrame(data1)

df1 = pd.DataFrame(data2)


print(df, "\n\n", df1)

  key key1    Name  Age
0  K0   K0     Jai   27
1  K1   K1  Princi   24
2  K2   K0  Gaurav   22
3  K3   K1    Anuj   32

   key key1    Address Qualification
0  K0   K0     Nagpur         Btech
1  K1   K0     Kanpur           B.A
2  K2   K0  Allahabad          Bcom
3  K3   K0    Kannuaj        B.hons

In [52]:
res1 = pd.merge(df, df1, on=['key', 'key1'])

res1

  key key1    Name  Age    Address Qualification
0  K0   K0     Jai   27     Nagpur         Btech
1  K2   K0  Gaurav   22  Allahabad          Bcom

In [53]:
res = pd.merge(df, df1, how='left', on=['key', 'key1'])

res

  key key1    Name  Age    Address Qualification
0  K0   K0     Jai   27     Nagpur         Btech
1  K1   K1  Princi   24        NaN           NaN
2  K2   K0  Gaurav   22  Allahabad          Bcom
3  K3   K1    Anuj   32        NaN           NaN

-------------Missing Data------------------

In [54]:
#Working with Missing Data in Pandas
import pandas as pd
import numpy as np

d = {'First Score': [100, 90, np.nan, 95],
        'Second Score': [30, 45, 56, np.nan],
        'Third Score': [np.nan, 40, 80, 98]}

In [55]:
df = pd.DataFrame(d)

In [56]:
mv = df.isnull()

In [57]:
print(mv)

   First Score  Second Score  Third Score
0        False         False         True
1        False         False        False
2         True         False        False
3        False          True        False

In [58]:
import pandas as pd
import numpy as np

data = {'Name': ['Amit', 'Sita', np.nan, 'Raj'],
        'Age': [25, np.nan, 22, 28]}

In [59]:
df = pd.DataFrame(data)

In [60]:
print(df.isna())

    Name    Age
0  False  False
1  False   True
2   True  False
3  False  False

In [61]:
import pandas as pd
   
df = pd.DataFrame({"A": [12, 4, 5, None, 1], 
                   "B": [None, 2, 54, 3, None], 
                   "C": [20, 16, None, 3, 8], 
                   "D": [14, 3, None, None, 6]})  
print(df)

      A     B     C     D
0  12.0   NaN  20.0  14.0
1   4.0   2.0  16.0   3.0
2   5.0  54.0   NaN   NaN
3   NaN   3.0   3.0   NaN
4   1.0   NaN   8.0   6.0

-----------Removing Duplicates---------------

In [62]:
import pandas as pd

In [63]:
df = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Alice', 'David'],
    'Age': [25, 30, 25, 40],
    'City': ['NY', 'LA', 'SF', 'Chicago']
})

In [64]:
df_cleaned = df.drop_duplicates(subset=["Name"])

In [65]:
print(df_cleaned)

    Name  Age     City
0  Alice   25       NY
1    Bob   30       LA
3  David   40  Chicago

In [66]:
df_cleaned= df.drop_duplicates(keep='last')
print(df_cleaned)

    Name  Age     City
0  Alice   25       NY
1    Bob   30       LA
2  Alice   25       SF
3  David   40  Chicago

In [70]:
df = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Alice', 'David'],
    'Age': [25, 30, 25, 40],
    'City': ['NY', 'LA', 'NY', 'Chicago']
})

In [71]:
df_cleaned= df.drop_duplicates(keep='last')
print(df_cleaned)

    Name  Age     City
1    Bob   30       LA
2  Alice   25       NY
3  David   40  Chicago

In [72]:
df_cleaned = df.drop_duplicates(keep=False)
print(df_cleaned)

    Name  Age     City
1    Bob   30       LA
3  David   40  Chicago

In [73]:
df_cleaned = df.drop_duplicates(subset=["Name", "City"])
print(df_cleaned)

    Name  Age     City
0  Alice   25       NY
1    Bob   30       LA
3  David   40  Chicago

------------Change DataType---------------

In [74]:
data = {'Name': ['John', 'Alice', 'Bob', 'Eve', 'Charlie'], 
        'Age': [25, 30, 22, 35, 28], 
        'Gender': ['Male', 'Female', 'Male', 'Female', 'Male'], 
        'Salary': [50000, 55000, 40000, 70000, 48000]}

In [75]:
df = pd.DataFrame(data)

In [76]:
df['Age'] = df['Age'].astype(float)
print(df.dtypes)

Name       object
Age       float64
Gender     object
Salary      int64
dtype: object

In [78]:
print(df)

      Name   Age  Gender  Salary
0     John  25.0    Male   50000
1    Alice  30.0  Female   55000
2      Bob  22.0    Male   40000
3      Eve  35.0  Female   70000
4  Charlie  28.0    Male   48000

In [79]:
# Example: Create a 'Join Date' column as a string
df['Join Date'] = ['2021-01-01', '2020-05-22', '2022-03-15', '2021-07-30', '2020-11-11']

In [80]:
df['Join Date'] = pd.to_datetime(df['Join Date'])
print(df.dtypes)

Name                 object
Age                 float64
Gender               object
Salary                int64
Join Date    datetime64[ns]
dtype: object

In [81]:
df = pd.DataFrame({'FirstName': ['Vipul', 'Ashish', 'Milan'],
                            "Gender": ["", "", ""],
                            "Age": [0, 0, 0]})

In [82]:
df['Department'] = np.nan

In [83]:
display(df)

  FirstName Gender  Age  Department
0     Vipul           0         NaN
1    Ashish           0         NaN
2     Milan           0         NaN

In [84]:
df.dropna(how='all', axis=1, inplace=True)

In [85]:
display(df)

  FirstName Gender  Age
0     Vipul           0
1    Ashish           0
2     Milan           0

-------------String Manipulation----------------

| Task                | Function                                        |
| ------------------- | ----------------------------------------------- |
| Lowercase           | `str.lower()`                                   |
| Uppercase           | `str.upper()`                                   |
| Remove spaces       | `str.strip()` / `str.lstrip()` / `str.rstrip()` |
| Replace text        | `str.replace('old','new')`                      |
| Split string        | `str.split()`                                   |
| Join list to string | `str.join()`                                    |
| Check contains      | `str.contains('text')`                          |
| Length of string    | `str.len()`                                     |
| Extract using regex | `str.extract(r'pattern')`                       |
| Slice string        | `str.slice(start, end)`                         |

--------------String Methods---------------

In [86]:
sports = pd.Series(['Virat', 'azam', 'fiNch', 'ShakiB', 'STOKES', 'KAne'])

In [87]:
print(sports)

0     Virat
1      azam
2     fiNch
3    ShakiB
4    STOKES
5      KAne
dtype: object

In [88]:
print(sports.str.upper())

0     VIRAT
1      AZAM
2     FINCH
3    SHAKIB
4    STOKES
5      KANE
dtype: object

In [90]:
print(sports.str.lower())

0     virat
1      azam
2     finch
3    shakib
4    stokes
5      kane
dtype: object

In [91]:
print(sports.str.isupper())

0    False
1    False
2    False
3    False
4     True
5    False
dtype: bool

In [93]:
print(sports.str.islower())

0    False
1     True
2    False
3    False
4    False
5    False
dtype: bool

In [94]:
print(sports.str.len())

0    5
1    4
2    5
3    6
4    6
5    4
dtype: int64

In [95]:
print(sports.str.startswith('a'))

0    False
1     True
2    False
3    False
4    False
5    False
dtype: bool

In [96]:
print(sports.str.split('a'))

0     [Vir, t]
1     [, z, m]
2      [fiNch]
3    [Sh, kiB]
4     [STOKES]
5       [KAne]
dtype: object

In [97]:
print(sports.str.find('a'))

0    3
1    0
2   -1
3    2
4   -1
5   -1
dtype: int64

In [99]:
print(sports.str.strip())

0     Virat
1      azam
2     fiNch
3    ShakiB
4    STOKES
5      KAne
dtype: object

In [100]:
print(sports.str.replace('a', ''))

0      Virt
1        zm
2     fiNch
3     ShkiB
4    STOKES
5      KAne
dtype: object

----------Data Processing-------------

#Load data
df = pd.read_csv("file.csv")
df = pd.read_excel("file.xlsx")
df = pd.read_json("file.json")
df = pd.read_sql(query, connection)

#Inspecting Data
df.head()
df.tail()
df.info()
df.describe()
df.shape
df.columns
df.dtypes

#Handling Missing Data
df.isnull().sum()
df.isna().sum()

df.fillna(value)
df.dropna()
df.interpolate(method='linear')

#Handling Duplicates
df.duplicated()
df.drop_duplicates(keep='first')
df.drop_duplicates(subset=['col1', 'col2'])

#Filtering and Selecting
df['col']
df[['col1', 'col2']]

#Row Selection
df.loc[rows, columns]
df.iloc[index_position]

#Conditional Filtering
df[df['Age'] > 30]
df[(df['City'] == 'NY') & (df['Age'] > 25)]

------------Data Transformation-------------------
#Rename Columns
df.rename(columns={'old':'new'})

#Replace Values
df.replace({'NY':'New York'})

#Apply Functions
df['Age_group'] = df['Age'].apply(lambda x: 'Adult' if x > 18 else 'Child')

#Working with Dates
df['date'] = pd.to_datetime(df['date'])
df['year'] = df['date'].dt.year
df['month'] = df['date'].dt.month
df['weekday'] = df['date'].dt.day_name()

#Reshaping Data

#Pivot
df.pivot(index='Date', columns='Product', values='Sales')

#Melt
df.melt(id_vars='Year', var_name='City', value_name='Population')